{
  "singleNumbers": {
    "1": {
      "meaning": "Represents leadership, independence, and pioneering spirit. It is the number of new beginnings and action. People with this number are often ambitious, determined, and have a strong will to succeed.",
      "weakness": "Can be overly aggressive, dominant, or egotistical. May struggle with being alone or feeling unsupported."
    },
    "6": {
      "meaning": "Signifies responsibility, nurturing, and domesticity. It is the number of harmony, love, and family. These individuals are often caring, protective, and seek to create a beautiful and stable environment.",
      "weakness": "Can become self-righteous, meddling, or a martyr. May take on too many burdens and neglect their own needs."
    }
  },
  "compoundNumbers": {
    "19": "Known as the 'Prince of Heaven'. This number is highly fortunate, promising happiness, success, and fulfillment. It indicates victory over all difficulties and is a number of great power and potential.",
    "33": "This is a Master Number. See Master Number meaning."
  },
  "masterNumbers": {
    "33": {
        "meaning": "The 'Master Teacher'. This number represents spiritual uplifting, selfless service, and compassion on a global scale. It combines the energies of 11 (intuition) and 22 (master builder) to inspire and heal humankind. It is the number of a spiritual guide.",
        "weakness": "Can be overly idealistic, stressed by the needs of others, and may struggle to apply their high ideals in the practical world."
    }
  },
  "karmicNumbers": {
    "19": {
        "meaning": "A Karmic Debt number. It indicates that in a past life, power was abused. The lesson in this life is to learn to stand on your own two feet, use your leadership abilities wisely, and serve others without becoming dictatorial."
    }
  },
  "elements": {
    "1": "Fire",
    "2": "Earth",
    "3": "Wood",
    "4": "Wood",
    "5": "Earth",
    "6": "Metal",
    "7": "Metal",
    "8": "Earth",
    "9": "Fire"
  },
  "psychicPeople": {
    "19": [
        "Indira Gandhi", "Ratan Tata", "Zeena Aman", "Bill Clinton", "Coco Chanel", "Matthew McConaughey", "Jodie Foster", "Isaac Newton", "Larry King", "Savitribai Phule"
    ]
  },
  "destinyPeople": {
    "33/6": [
        "Albert Einstein", "Thomas Edison", "Stephen King", "Meryl Streep", "Robert De Niro", "John Lennon", "Salma Hayek", "Francis Ford Coppola", "Ayatollah Khomeini", "Heather Locklear"
    ]
  }
}